espressif/esp-usb/host/class/uac/usb_host_uac/test_app/sdkconfig.ci.esp32p4_psram
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

# Enable experimental features, to set PSRAM frequency to 200 MHz
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Enable PSRAM and set PSRAM frequency
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
# CONFIG_SPIRAM_MEMTEST is not set

# Allocate USB_DWC DMA capable memory in PSRAM
CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM=y
